cfd/OpenFOAM/incompressible/pimpleFoam/02_MovingMesh/system/include/geometryRefinement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Near geometry refinement
nearGeometryRefinementDistance 2.0;
nearGeometryRefinementLevel    4;

// Geometry surfaces refinement
surfacesRefinementLevel 7;
edgesRefinementLevel    7;

// Geometry features refinement
geometryFeaturesRefinementLevel 7;
